:: НЕ ЗАВЕРШЕНО
:: Tortoise Hg не засекает изменения целевых файлов по ссылкам, но симлинки с модифицированной датой записи предлагает коммитить (и только у симлинков
:: с изменённой датой записи он будет смотреть изменение содержимого целевого файла).
:: Планировалось, что с пом. этого скрипта будут обновляться даты записи и изменения именно ссылок, но добиться желаемого
:: не удалось, т. к. портированная утилита touch изменяет дату целевого файла, а не ссылки.
:: Также я пробовал реализовать задуманное с пом. Python 3.8, но и там столкнулся с этой же проблемой; в документации у метода os.utime есть параметр 
:: follow_symlinks, но в Windows он не реализован :-(
:: Поэтому пока скрипт просто удаляет имеющиеся ссылки и создаёт новые. Это нужно просто для того, чтобы не провтыкать закоммитить изменения.
:: Жесткие ссылки использовать нельзя, т. к. при сохранении изменений Qt Creator удаляет и создаёт новый файл и связь разрушается.
:: Можно коммитить абсолютно все симлинки, даже те, которые указывают на неизменённые файлы — при просмотре ревизии в Hg Workbench
:: будут отображаться только реально изменённые файлы.
@echo off
chcp 65001 >NUL 2>&1
set "sync_tool=D:\solderer\my_docs\Projects\Programming\symlink-sync\build\Desktop_Qt_5_15_2_mingw81_64-Release\release\symlink-sync.exe"
setlocal EnableExtensions EnableDelayedExpansion
:: обработка путей симлинков: i - имя ссылки, j - путь к целефому файлу с ] в конце
FOR /F "tokens=2,3 delims=>[" %%i in ('dir /aL ^| findstr /R "[.*]"') do (
  set file_=%%j
  :: удаление ] в конце
  set file_=!file_:~0,-1!
  :: даты записи целевых файлов: k - дата, l - время
  echo %%i
)
